
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version L-2016.03-SP3 for linux64 - Jul 18, 2016 

                    Copyright (c) 1988 - 2016 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...


Settings:
search_path:       $PWD ./libs ./db ./source ./scripts /media/datos/IBM/TECH/ibm130_lp/digital
link_library:      * scx3_cmos8rf_lpvt_tt_1p2v_25c.db dw_foundation.sldb
target_library:    scx3_cmos8rf_lpvt_tt_1p2v_25c.db
symbol_library:    iogpil_cmrf8sf_rvt.sdb


I am ready...

Initializing gui preferences from file  /home/local/ESTUDIANTES/jsequeira/.synopsys_dv_prefs.tcl
dc_shell> 4.1
dc_shell> # Eliminar diseños previos
dc_shell> remove_design -designs
1
dc_shell> # Primero se analiza el módulo principal
dc_shell> analyze -library WORK -format verilog {multiplier_combinational.v}
Running PRESTO HDLC
Compiling source file ./source/multiplier_combinational.v
Presto compilation completed successfully.
Loading db file '/media/datos/IBM/TECH/ibm130_lp/digital/scx3_cmos8rf_lpvt_tt_1p2v_25c.db'
Loading db file '/mnt/vol_NFS_Zener/tools/synopsys/apps/syn/L-2016.03-SP3/libraries/syn/dw_foundation.sldb'
1
dc_shell> elaborate multiplier_C -architecture verilog -library WORK
Loading db file '/mnt/vol_NFS_Zener/tools/synopsys/apps/syn/L-2016.03-SP3/libraries/syn/gtech.db'
Loading db file '/mnt/vol_NFS_Zener/tools/synopsys/apps/syn/L-2016.03-SP3/libraries/syn/standard.sldb'
  Loading link library 'scx3_cmos8rf_lpvt_tt_1p2v_25c'
  Loading link library 'gtech'
Running PRESTO HDLC
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'multiplier_C'.
1
Current design is 'multiplier_C'.
dc_shell> link

  Linking design 'multiplier_C'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  multiplier_C                /home/local/ESTUDIANTES/jsequeira/Karatsuba_FPU/ASIC/integracion_fisica/front_end/multiplier_C.db
  scx3_cmos8rf_lpvt_tt_1p2v_25c (library) /media/datos/IBM/TECH/ibm130_lp/digital/scx3_cmos8rf_lpvt_tt_1p2v_25c.db
  dw_foundation.sldb (library) /mnt/vol_NFS_Zener/tools/synopsys/apps/syn/L-2016.03-SP3/libraries/syn/dw_foundation.sldb

1
dc_shell> Loading db file '/media/datos/IBM/TECH/ibm130_lp/digital/iogpil_cmrf8sf_rvt.sdb'
Loading db file '/mnt/vol_NFS_Zener/tools/synopsys/apps/syn/L-2016.03-SP3/libraries/syn/generic.sdb'
remove_design -designs
Removing design 'multiplier_C'
1
dc_shell> analyze -library WORK -format verilog {multiplier_combinational.v}
Running PRESTO HDLC
Compiling source file ./source/multiplier_combinational.v
Presto compilation completed successfully.
1
dc_shell> elaborate multiplier_C -architecture verilog -library WORK
Running PRESTO HDLC
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'multiplier_C'.
1
Current design is 'multiplier_C'.
dc_shell> link

  Linking design 'multiplier_C'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  multiplier_C                /home/local/ESTUDIANTES/jsequeira/Karatsuba_FPU/ASIC/integracion_fisica/front_end/multiplier_C.db
  scx3_cmos8rf_lpvt_tt_1p2v_25c (library) /media/datos/IBM/TECH/ibm130_lp/digital/scx3_cmos8rf_lpvt_tt_1p2v_25c.db
  dw_foundation.sldb (library) /mnt/vol_NFS_Zener/tools/synopsys/apps/syn/L-2016.03-SP3/libraries/syn/dw_foundation.sldb

1
dc_shell> compile
Information: Checking out the license 'DesignWare'. (SEC-104)
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | L-2016.03-DWBB_201603.3 |     *     |
| Licensed DW Building Blocks        | L-2016.03-DWBB_201603.3 |     *     |
============================================================================



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'multiplier_C'

  Updating timing information
Information: Updating design information... (UID-85)
Information: Design 'multiplier_C' has no optimization constraints set. (OPT-108)

  Beginning Implementation Selection
  ----------------------------------
  Mapping 'multiplier_C_DW_mult_uns_0'

  Beginning Mapping Optimizations  (Medium effort)
  -------------------------------
Information: Added key list 'DesignWare' to design 'multiplier_C'. (DDB-72)
  Structuring 'multiplier_C'
  Mapping 'multiplier_C'

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:03     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
    0:00:04     233.3      0.00       0.0       0.0                          
Loading db file '/media/datos/IBM/TECH/ibm130_lp/digital/scx3_cmos8rf_lpvt_tt_1p2v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
1
dc_shell> dc_shell> 